#+title: Reduce all the things
#+tags: swift cocoa ios
#+keywords: feature swift reduce map filter group partition split interpose chunk functional programming flatMap
#+summary: An introduction into the reduce function as an alternative to map, flatMap or filter for collection transformation
#+description: An introduction into the reduce function as an alternative to map, flatMap or filter for collection transformation
#+OPTIONS: toc:nil

#+BEGIN_EXPORT html
<h6><a href="http://swift.gg/2015/12/10/reduce-all-the-things/">This post is also available in <b>🇨🇳Chinese</b></a><span> Thanks to </span><a href="http://swift.gg/tags/APPVENTURE/">SwiftGG</a></h6>
#+END_EXPORT

Even before Swift was released, iOS / Cocoa developers could use third party frameworks like ObjectiveSugar or ReactiveCocoa in order to gain functional programming constructs like =map=, =flatMap= or =filter=. With Swift, they have become first class language citizens. There are many advantages to using them over a standard =for= loop. They typically express your intent better, they require less code, and they can be chained together in order to build up complex logic in a clear way. 

In this post, I'd like to show another very cool functional addition to Swift which can sometimes be a better solution than =map= / =filter= constructs: =reduce=.

** Map

#+BEGIN_SRC swift :prologue "import Foundation"
func rmap(elements: [Int], transform: (Int) -> Int) -> [Int] {
    return elements.reduce([Int](), combine: { (var acc: [Int], obj: Int) -> [Int] in
       acc.append(transform(obj))
       return acc
    })
}
print(rmap([1, 2, 3, 4], transform: { $0 * 2}))
// [2, 4, 6, 8]
#+END_SRC

This is a good example to understand the basics of =reduce=. 
- First, we're calling reduce on a sequence of elements =elements.reduce...=.
- Next, We're giving it the accumulator, i.e. an empty Int array, which will form or return type / result =[Int]()=
- After that, we're handing in the =combinator= which takes two parameters. The first is the accumulator which we just provided =acc: [Int]=, the second is the current object from our sequence =obj: Int=. 
- The actual code in the =combinator= is simple. We simply transform the obj and append it onto the accumulator. We then return the accumulator.

This looks like much more code than just calling =map=. That's indeed true, but the version above is extra detailed in order to better explain how =reduce= works. We can simplify it.

#+BEGIN_SRC swift :prologue "import Foundation"
func rmap(elements: [Int], transform: (Int) -> Int) -> [Int] {
    return elements.reduce([Int](), combine: {$0 + [transform($1)]})
}
print(rmap([1, 2, 3, 4], transform: { $0 * 2}))
// [2, 4, 6, 8]
#+END_SRC

#+RESULTS:
: [2 (\, 4) (\, 6) (\, 8)]

This still works fine. What happened here? We're using the convenient fact that in Swift, the =+= operator also works for two sequences. So =[0, 1, 2] + [transform(4)]= takes the left sequence and adds the right sequence, consisting out of the transformed element, to it.

It should be noted that, as of right now, =[1, 2, 3] + [4]= is slower than =[1, 2, 3].append(4)=. If you operate on huge lists, instead of using collection + collection, you should have a mutable accumulator and mutate it in place:

#+BEGIN_SRC swift
func rmap(elements: [Int], transform: (Int) -> Int) -> [Int] {
    return elements.reduce([Int](), combine: { (var ac: [Int], b: Int) -> [Int] in 
        ac.append(transform(b))
        return ac
    })
}
#+END_SRC

In order to better understand =reduce= we will now go on and also implement =flatMap= and =filter=.
#+BEGIN_SRC swift :prologue "import Foundation"
func rflatMap(elements: [Int], transform: (Int) -> Int?) -> [Int] {
    return elements.reduce([Int](), 
       combine: { guard let m = transform($1) else { return $0 } 
                  return $0 + [m]})
}
print(rflatMap([1, 3, 4], transform: { guard $0 != 3 else { return nil }; return $0 * 2}))
// [2, 8]
#+END_SRC

#+RESULTS:
: [2 (\, 8)]

The main difference is that we're adding a =guard= to make sure the optional contains a value.

** Filter

#+BEGIN_SRC swift :prologue "import Foundation"
func rFilter(elements: [Int], filter: (Int) -> Bool) -> [Int] {
    return elements.reduce([Int](), 
       combine: { guard filter($1) else { return $0 } 
                  return $0 + [$1]})
}
print(rFilter([1, 3, 4, 6], filter: { $0 % 2 == 0}))
// [4, 6]
#+END_SRC

#+RESULTS:
: [4 (\, 6)]

Again, a simple operation. We're leveraging guard again to make sure our filter condition holds.

Up until now, =reduce= may feel like a more complicated version of =map= or =filter= without any major advantages. However, the combinator does not need to be an array. It can be anything. This makes it easy for us to implement various reduction operations in a very simple way.

* InfoFromState, take two

#+BEGIN_SRC swift :noweb strip-export :prologue "import Foundation"
  <<data>>
  
  func infoFromState(state state: String, persons: [[String: AnyObject]]) 
      -> (count: Int, age: Float) {

      // The type alias in the function will keep the code cleaner
      typealias Acc = (count: Int, age: Float)

      // reduce into a temporary variable
      let u = persons.reduce((count: 0, age: 0.0)) {
          (ac: Acc, p) -> Acc in

          // Retrive the state and the age
          guard let personState = (p["city"] as? String)?.componentsSeparatedByString(", ").last,
                personAge = p["age"] as? Int
            
            // make sure the person is from the correct state
            where personState == state
            
            // if age or state are missing, or personState!=state, leave
            else { return ac }
          
          // Finally, accumulate the acount and the age
          return (count: ac.count + 1, age: ac.age + Float(personAge))
      }
  
  // our result is the count and the age divided by count
  return (age: u.age / Float(u.count), count: u.count)
}
print(infoFromState(state: "CA", persons: persons))
// prints: (count: 3, age: 34.3333)
#+END_SRC

#+RESULTS:
: (3, 34.3333)

As in earlier examples above, we're once again using a =tuple= to share state in the accumulator. Apart from that, the code is easy to understand.

We also defined a =typealias= *Acc* within the =func= in order to simplify the type annotations a bit.

** Unique

Return a list with all duplicates removed. The better solution would be to use a =Set=.

#+BEGIN_SRC swift
[1, 2, 5, 1, 7].reduce([], combine: { (a: [Int], b: Int) -> [Int] in
if a.contains(b) {
   return a
} else {
   return a + [b]
}
})
// prints: 1, 2, 5, 7
#+END_SRC

#+RESULTS:
: [1 (\, 2) (\, 5) (\, 7)]


** Group By

Go over a list and return a new list with the previous list' items grouped by a discriminator function. The function in question needs to return a =Hashable= type so that we can differentiate keys. The order of the items will be preserved while the order of the groups won't necessarily be preserved.

#+BEGIN_SRC swift
func groupby<T, H: Hashable>(items: [T], f: (T) -> H) -> [H: [T]] {
   return items.reduce([:], combine: { (var ac: [H: [T]], o: T) -> [H: [T]] in 
       let h = f(o)
       if var c = ac[h] {
           c.append(o)
           ac.updateValue(c, forKey: h)
       } else {
           ac.updateValue([o], forKey: h)
       }
       return ac
   })
}
print(groupby([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12], f: { $0 % 3 }))
// prints: [2: [2, 5, 8, 11], 0: [3, 6, 9, 12], 1: [1, 4, 7, 10]]
print(groupby(["Carl", "Cozy", "Bethlehem", "Belem", "Brand", "Zara"], f: { $0.characters.first! }))
// prints: ["C" : ["Carl" , "Cozy"] , "B" : ["Bethlehem" , "Belem" , "Brand"] , "Z" : ["Zara"]]
#+END_SRC

#+RESULTS:
: ["C" : ["Carl" (\, "Cozy")] (\, "B") : ["Bethlehem" (\, "Belem") (\, "Brand")] (\, "Z") : ["Zara"]]

